---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewScale
source: html/78f898b0-8edf-469f-d79e-7e825d9942d7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewScale Property

"Scale Value 1:"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewScale { get; }
```